namespace HW_03_Ants
{
    internal class Program
    {    
        static void Main(string[] args)
        {
            //Представим себе искусственный муравейник. В нем живут виртуальные муравьи, которые выполняют различные задачи:
            //добывают пищу, строят муравейник, ухаживают за маткой и т.д.
            //Каждый муравей имеет свои характеристики: энергия, возраст, роль в колонии.

            //Реализуйте симуляцию муравейника, используя многопоточность.

            //Функционал:
            //⦁	Мир: Создать двумерный массив, представляющий муравейник и окружающую среду.

            //⦁	Муравей:
            //⦁	Имеет координаты, энергию, возраст, роль.
            //⦁	Может перемещаться по миру, искать пищу, строить муравейник, ухаживать за маткой.
            //⦁	Имеет определенную логику поведения, основанную на его состоянии и окружающей среде.

            //⦁	Многопоточность:
            //⦁	Каждый муравей должен быть представлен отдельным потоком или задачей.

            //⦁	Визуализация:
            //⦁	Реализовать простую визуализацию муравейника, чтобы наблюдать за поведением муравьев.
            AntNest nest = new AntNest(10, 10);

            Ant ant1 = new Ant(AntRole.Worker);
            Ant ant2 = new Ant(AntRole.Worker);
            Ant ant6 = new Ant(AntRole.Worker);
            Ant ant3 = new Ant(AntRole.Farmer);
            Ant ant4 = new Ant(AntRole.Farmer);
            Ant ant5 = new Ant(AntRole.Warrior);
            Ant ant7 = new Ant(AntRole.Warrior);

            nest.AddAnt(ant1, ant2, ant3, ant4, ant5,ant6, ant7);

            nest.NestAwake();
            nest.DisplayNest();

        }
    }
}
